app/views/roasts/show.html.erb

    <% unless @roast.brews == nil %>
    <% @roast.brews.each do |b| %>
---
SELECT "brews".* FROM "brews"  WHERE "brews"."roast_id" = $1  [["roast_id", 1]]