app/controllers/brands_controller.rb

  def show
  	@brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands"  WHERE "brands"."id" = $1 LIMIT 1  [["id", 1]]