app/views/brands/show.html.erb

SELECT "roasts".* FROM "roasts"  WHERE "roasts"."brand_id" = $1  [["brand_id", 1]]
---
	<div class="col-md-9">
		<% @brand.roasts.each do |b| %>